OpenFOAM-v2112/tutorials/incompressible/pisoFoam/RAS/cavity/Allrun-parallel
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
#------------------------------------------------------------------------------

runApplication blockMesh

restore0Dir

runApplication decomposePar

runParallel topoSet

runParallel $(getApplication)

#------------------------------------------------------------------------------
