OpenFOAM-v2112/tutorials/incompressible/pisoFoam/RAS/cavity/system/FOreadFields
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

readFields1
{
    // Mandatory entries
    type            readFields;
    libs            (fieldFunctionObjects);
    fields          (U p);

    // Optional entries
    readOnStart     true;

    // Optional (inherited) entries
    region          region0;
    enabled         true;
    log             true;
    timeStart       0.25;
    timeEnd         1000;
    executeControl  timeStep;
    executeInterval 5;
    writeControl    timeStep;
    writeInterval   25;
}


// ************************************************************************* //
